tests/cases/moldCycles/system/verifyScript
verify-mold-cycles.py
